<template>
  <el-table :data="tableData" style="width: 100%" :height="400">
    <el-table-column prop="name" label="项目名称" header-align="center" align="center" />
    <el-table-column prop="score" label="获得积分" header-align="center" align="center" />
  </el-table>
</template>

<script setup lang="ts">
const names = [
  '爱国主义教育',
  '主题教育活动',
  '参加时政学习',
  '时政比赛',
  '参加党团学习',
  '参加安全教育',
  '法制教育',
  '参加国防民防教育',
  '优秀学员',
  '合格学员',
  '参加社团',
  '纪律处分',
  '迟到早退一次',
  '上课缺勤一次',
  '不准时出操',
  '未按规定着装校服校裤',
  '佩戴胸卡',
  '不染发',
  '不烫发',
  '不披散长发',
  '不化妆不美甲不佩戴首饰',
  '礼貌用语',
  '文明就餐',
  '个人卫生',
  '书桌整洁',
  '前十名班级',
  '评为先进',
  '国家奖学金',
  '市级',
  '区级（行业）',
  '校级',
  '平均≥90分',
  '平均≥80分',
  '平均≥70分',
  '平均≥60分',
  '每个证书',
  '国家级',
  '市级',
  '区级',
  '校级',
  '国家级',
  '市级',
  '区级',
  '校级',
  '发明专利',
  '体质达标',
  '参加体育课外活动',
  '国家级',
  '市级',
  '区级',
  '校级',
  '参加心理剧或心理月展示活动',
  '参与心理中心活动',
  '场馆观摩',
  '国家级比赛',
  '市级比赛',
  '区级比赛',
  '校级比赛',
  '学校及以上组织',
  '参加志愿服务每次',
  '参加交通岗值勤',
  '修满学分',
  '日常家务劳动',
  '值日值周',
  '修满学分',
];

const tableData = names.map(name => {
  return {
    name: name,
    score: Math.floor(Math.random() * 100 + 10),
  };
});
</script>
